/** @description 获取文章 */
export const getDocumentList = (index: number) => {
  let document = documentList[index]
  // 去除文档的标点符号
  document = {
    ...document,
    content: document.content
      .replace(/[。，、；：！？''""「」『』（）【】《》〈〉…—～·]/g, 'A')
      .replace(/A/g, ' '),
  }
  return document
}

// 文章列表
const documentList = [
  {
    title: '第一章',
    content:
      '道可道也，非恒道也。名可名也，非恒名也。无名，万物之始也；有名，万物之母也。故恒无欲也，以观其眇；恒有欲也，以观其所徼。两者同出，异名同谓。玄之又玄，众眇之门。',
  },
  {
    title: '第二章',
    content:
      '天下皆知美之为美，恶已；皆知善之为善，斯不善已。有无之相生也，难易之相成也，长短之相形也，高下之相盈也，音声之相和也，先后之相随，恒也。是以圣人居无为之事，行不言之教。万物作而弗始也，为而弗志也，成功而弗居也。夫唯弗居，是以弗去。',
  },
  {
    title: '第三章',
    content:
      '不上贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民不乱。是以圣人之治也，虚其心，实其腹，弱其志，强其骨。恒使民无知无欲也，使夫知不敢弗为而已，则无不治矣。',
  },
  {
    title: '第四章',
    content:
      '道冲，而用之有弗盈也。渊呵！似万物之宗。锉其兑，解其纷，和其光，同其尘。湛呵！似或存。吾不知其谁之子，象帝之先。',
  },
  {
    title: '第五章',
    content:
      '天地不仁，以万物为刍狗；圣人不仁，以百姓为刍狗。天地之间，其犹橐龠与？虚而不淈，动而愈出。多闻数穷，不若守于中。',
  },
  {
    title: '第六章',
    content: '浴神不死，是谓玄牝。玄牝之门，是谓天地之根。绵绵呵，若存，用之不堇。',
  },
  {
    title: '第七章',
    content:
      '天长地久。天地之所以能长且久者，以其不自生也，故能长生。是以圣人芮其身而身先，外其身而身存。不以其无私与？故能成其私。',
  },
  {
    title: '第八章',
    content:
      '上善若水。水善利万物而有争，居众人之所恶，故几于道矣。居善地，心善渊，予善信，正善治，事善能，踵善时。夫唯不争，故无尤。',
  },
  {
    title: '第九章',
    content:
      '持而盈之，不若其已。揣而锐之，不可长葆也。金玉盈室，莫之守也。贵富而骄，自遗咎也。功遂身芮，天之道也。',
  },
  {
    title: '第十章',
    content:
      '载营魄抱一，能毋离乎？抟气至柔，能婴儿乎？涤除玄鉴，能毋疵乎？爱民栝国，能毋以知乎？天门启阖，能为雌乎？明白四达，能毋以知乎？生之畜之，生而弗有，长而弗宰也，是谓玄德。',
  },
  {
    title: '第十一章',
    content:
      '卅辐同一毂，当其无，有车之用也。埏埴为器，当其无，有埴器之用也。凿户牖，当其无，有室之用也。故有之以为利，无之以为用。',
  },
  {
    title: '第十二章',
    content:
      '五色使人目盲，驰骋田猎使人心发狂，难得之货使人之行妨，五味使人之口爽，五音使人之耳聋。是以圣人之治也，为腹而不为目，故去彼而取此。',
  },
  {
    title: '第十三章',
    content:
      '宠辱若惊，贵大患若身。何谓宠辱若惊？宠之为下，得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身？吾所以有大患者，为吾有身也，及吾无身，有何患？故贵为身于为天下，若可以托天下矣；爱以身为天下，若可以寄天下矣。',
  },
  {
    title: '第十四章',
    content:
      '视之而弗见，名之曰微；听之而弗闻，名之曰希；捪之而弗得，名之曰夷。三者不可致诘，故混而为一。其上不皦，其下不昧。寻寻呵，不可名也，复归于无物。是谓无状之状，无物之象，是谓沕望。随而不见其后，迎而不见其首。执今之道，以御今之有，以知古始，是谓道纪。',
  },
  {
    title: '第十五章',
    content:
      '古之善为道者，微眇玄达，深不可志。夫唯不可志，故强为之容，曰：豫呵，其若冬涉水；犹呵，其若畏四邻；严呵，其若客；涣呵，其若凌释；沌呵，其若朴；湷呵，其若浊；旷呵，其若谷。浊而静之，徐清；安以动之，徐生。葆此道不欲盈，夫唯不欲盈，是以能蔽而不成。',
  },
  {
    title: '第十六章',
    content:
      '致虚极也，守静笃也。万物并作，吾以观其复也。天物芸芸，各复归于其根。曰静，静是谓复命。复命常也，知常明也。不知常，妄，妄作凶。知常容，容乃公，公乃王，王乃天，天乃道，道乃久，没身不殆。',
  },
  {
    title: '第十七章',
    content:
      '大上，下知有之；其次，亲誉之；其次，畏之；其下，侮之。信不足，案有不信。犹呵，其贵言也。成功遂事，而百姓谓我自然。',
  },
  {
    title: '第十八章',
    content: '故大道废，案有仁义；知快出，案有大伪；六亲不和，案有孝慈；邦家昏乱，案有贞臣。',
  },
  {
    title: '第十九章',
    content:
      '绝圣弃知，民利百倍；绝仁弃义，民复孝慈；绝巧弃利，盗贼无有。此三言也，以为文未足，故令之有所属：见素抱朴，少私寡欲。',
  },
  {
    title: '第二十章',
    content:
      '绝学无忧。唯与诃，其相去几何？美与恶，其相去何若？人之所畏，亦不可以不畏。人望呵，其未央哉！众人熙熙，若乡于大牢而春登台。我泊焉未兆，若婴儿未咳。累呵，如无所归。众人皆有余，我独遗。我愚人之心也，湷湷呵！鬻人昭昭，我独若昏呵！鬻人蔡蔡，我独闷闷呵！忽呵，其若海；望呵，其若无所止。众人皆有以，我独顽以鄙。吾欲独异于人，而贵食母。',
  },
  {
    title: '第二十一章',
    content:
      '孔德之容，唯道是从。道之物，唯望唯忽。忽呵望呵，中有象呵；望呵忽呵，中有物呵；幽呵冥呵，中有请呵。其请甚真，其中有信。自今及古，其名不去，以顺众父。吾何以知众父之然？以此。',
  },
  {
    title: '第二十二章',
    content:
      '炊者不立，自视不彰，自见者不明，自伐者无功，自矜者不长。其在道，曰余食赘行。物或恶之，故有欲者弗居。',
  },
  {
    title: '第二十三章',
    content:
      '曲则全，枉则正，洼则盈，敝则新，少则得，多则惑。是以圣人执一，以为天下牧。不自视故彰，不自见故明，不自伐故有功，弗矜故能长。夫唯不争，故莫能与之争。古之所谓曲全者，几语才？诚全归之。',
  },
  {
    title: '第二十四章',
    content:
      '希言自然。飘风不终朝，暴雨不终日。孰为此？天地而弗能久，又况于人乎？故从事而道者，同于道；德者，同于德；失者，同于失。同于德者，道亦德之；同于失者，道亦失之。',
  },
  {
    title: '第二十五章',
    content:
      '有物混成，先天地生。寂呵寥呵，独立而不改，可以为天地母。吾未知其名，字之曰道，强为之名曰大。大曰逝，逝曰远，远曰反。道大，天大，地大，王亦大。国中有四大，而王居一焉。人法地，地法天，天法道，道法自然。',
  },
  {
    title: '第二十六章',
    content:
      '重为轻根，静为躁君。是以君子终日行，不离其辎重。唯有环官，燕处则昭若。若何万乘之王，而以身轻于天下？轻则失本，躁则失君。',
  },
  {
    title: '第二十七章',
    content:
      '善行者无辙迹，善言者无瑕谪，善数者不以筹策，善闭者无关龠而不可启也，善结者无绳约而不可解也。是以圣人恒善救人，而无弃人，物无弃财，是谓袭明。故善人，善人之师；不善人，善人之资也。不贵其师，不爱其资，虽知乎大迷，是谓眇要。',
  },
  {
    title: '第二十八章',
    content:
      '知其雄，守其雌，为天下溪。为天下溪，恒德不离。恒德不离，复归于婴儿。知其白，守其辱，为天下谷。为天下谷，恒德乃足。恒德乃足，复归于朴。知其白，守其黑，为天下式。为天下式，恒德不忒。恒德不忒，复归于无极。朴散则为器，圣人用则为官长。夫大制无割。',
  },
  {
    title: '第二十九章',
    content:
      '将欲取天下而为之，吾见其弗得已。夫天下，神器也，非可为者也。为者败之，执者失之。物或行或随，或嘘或吹，或强或羸，或培或堕。是以圣人去甚，去大，去奢。',
  },
  {
    title: '第三十章',
    content:
      '以道佐人主，不以兵强于天下。其事好还。师之所居，楚棘生之。善者果而已矣，毋以取强焉。果而毋骄，果而勿矜，果而毋伐，果而毋得已居，是谓果而不强。物壮而老，是谓之不道，不道早已。',
  },
  {
    title: '第三十一章',
    content:
      '夫兵者，不祥之器也。物或恶之，故有欲者弗居。君子居则贵左，用兵则贵右。故兵者，非君子之器也。兵者，不祥之器也，不得已而用之。铦袭为上，勿美也。若美之，是乐杀人也。夫乐杀人，不可以得志于天下矣。是以吉事上左，丧事上右。是以偏将军居左，上将军居右，言以丧礼居之也。杀人众，以悲哀立之；战胜，以丧礼处之。',
  },
  {
    title: '第三十二章',
    content:
      '道恒无名，朴虽小，而天下弗敢臣。侯王若能守之，万物将自宾。天地相合，以雨甘露，民莫之令而自均焉。始制有名，名亦既有，夫亦将知止。知止所以不殆。俾道之在天下也，犹小谷之与江海也。',
  },
  {
    title: '第三十三章',
    content:
      '知人者智也，自知者明也。胜人者有力也，自胜者强也。知足者富也，强行者有志也。不失其所者久也，死而不忘者寿也。',
  },
  {
    title: '第三十四章',
    content:
      '道泛呵，其可左右也。成功遂事而弗名有也。万物归焉而弗为主，则恒无欲也，可名于小。万物归焉而弗为主，可名于大。是以圣人之能成大也，以其不为大也，故能成大。',
  },
  {
    title: '第三十五章',
    content:
      '执大象，天下往。往而不害，安平大。乐与饵，过格止。故道之出言也，曰淡呵其无味也。视之不足见也，听之不足闻也，用之不可既也。',
  },
  {
    title: '第三十六章',
    content:
      '将欲歙之，必固张之；将欲弱之，必固强之；将欲去之，必固与之；将欲夺之，必固予之。是谓微明。柔弱胜强。鱼不可脱于渊，邦利器不可以示人。',
  },
  {
    title: '第三十七章',
    content:
      '道恒无名，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。镇之以无名之朴，夫将不辱。不辱以静，天地将自正。',
  },
  {
    title: '第三十八章',
    content:
      '上德不德，是以有德；下德不失德，是以无德。上德无为而无以为也，上仁为之而无以为也，上义为之而有以为也，上礼为之而莫之应也，则攘臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄也，而乱之首也。前识者，道之华也，而愚之首也。是以大丈夫居其厚而不居其薄，居其实而不居其华。故去彼而取此。',
  },
  {
    title: '第三十九章',
    content:
      '昔之得一者：天得一以清，地得一以宁，神得一以灵，谷得一以盈，侯王得一而以为天下正。其致之也，谓天毋已清将恐裂，谓地毋已宁将恐发，谓神毋已灵将恐歇，谓谷毋已盈将恐竭，谓侯王毋已贵以高将恐蹶。故必贵而以贱为本，必高矣而以下为基。夫是以侯王自谓孤、寡、不谷。此其贱之本与非也？故致数与无与。是故不欲禄禄若玉，硌硌若石。',
  },
  {
    title: '第四十章',
    content:
      '上士闻道，堇能行之；中士闻道，若存若亡；下士闻道，大笑之。弗笑不足以为道。是以建言有之曰：明道如费，进道如退，夷道如类。上德如谷，大白如辱，广德如不足，建德如偷，质真如渝。大方无隅，大器晚成，大音希声，天象无刑。道隐无名，夫唯道，善始且善成。',
  },
  {
    title: '第四十一章',
    content: '反也者，道之动也；弱也者，道之用也。天下之物生于有，有生于无。',
  },
  {
    title: '第四十二章',
    content:
      '道生一，一生二，二生三，三生万物。万物负阴而抱阳，冲气以为和。人之所恶，唯孤、寡、不谷，而王公以自名也。物或损之而益，益之而损。故人之所教，亦议而教人。故强良者不得死，我将以为学父。',
  },
  {
    title: '第四十三章',
    content:
      '天下之至柔，驰骋于天下之至坚。无有入于无间，吾是以知无为之有益也。不言之教，无为之益，天下希能及之矣。',
  },
  {
    title: '第四十四章',
    content:
      '名与身孰亲？身与货孰多？得与亡孰病？甚爱必大费，多藏必厚亡。故知足不辱，知止不殆，可以长久。',
  },
  {
    title: '第四十五章',
    content:
      '大成若缺，其用不敝；大盈若盅，其用不穷。大直如诎，大巧如拙，大赢如绌。躁胜寒，静胜热，清静可以为天下正。',
  },
  {
    title: '第四十六章',
    content:
      '天下有道，却走马以粪；天下无道，戎马生于郊。罪莫大于可欲，祸莫大于不知足，咎莫憯于欲得。故知足之足，恒足矣。',
  },
  {
    title: '第四十七章',
    content:
      '不出于户，以知天下；不窥于牖，以知天道。其出也弥远，其知也弥少。是以圣人不行而知，不见而明，弗为而成。',
  },
  {
    title: '第四十八章',
    content:
      '为学者日益，闻道者日损。损之又损，以至于无为。无为而无不为。取天下恒无事，及其有事也，不足以取天下。',
  },
  {
    title: '第四十九章',
    content:
      '圣人恒无心，以百姓之心为心。善者善之，不善者亦善之，德善也。信者信之，不信者亦信之，德信也。圣人之在天下，歙歙焉，为天下浑心。百姓皆属其耳目焉，圣人皆孩之。',
  },
  {
    title: '第五十章',
    content:
      '出生入死。生之徒十有三，死之徒十有三，而民生生动皆之死地之十有三。夫何故也？以其生生也。盖闻善执生者，陵行不辟兕虎，入军不被甲兵。兕无所揣其角，虎无所措其爪，兵无所容其刃。夫何故也？以其无死地焉。',
  },
  {
    title: '第五十一章',
    content:
      '道生之而德畜之，物形之而器成之。是以万物尊道而贵德。道之尊，德之贵也，夫莫之爵而恒自然也。道生之，畜之，长之，育之，亭之，毒之，养之，覆之。生而弗有也，为而弗恃也，长而弗宰也，是谓玄德。',
  },
  {
    title: '第五十二章',
    content:
      '天下有始，以为天下母。既得其母，以知其子；复守其母，没身不殆。塞其兑，闭其门，终身不勤。启其兑，济其事，终身不棘。见小曰明，守柔曰强。用其光，复归其明，毋遗身殃，是谓袭常。',
  },
  {
    title: '第五十三章',
    content:
      '使我介有知，行于大道，唯施是畏。大道甚夷，民甚好解。朝甚除，田甚芜，仓甚虚。服文采，带利剑，厌食而资财有余，是谓盗夸。盗夸非道也。',
  },
  {
    title: '第五十四章',
    content:
      '善建者不拔，善抱者不脱，子孙以祭祀不辍。修之身，其德乃真；修之家，其德有余；修之乡，其德乃长；修之邦，其德乃丰；修之天下，其德乃博。以身观身，以家观家，以乡观乡，以邦观邦，以天下观天下。吾何以知天下之然？兹以此。',
  },
  {
    title: '第五十五章',
    content:
      '含德之厚者，比于赤子。蜂虿虺蛇弗螫，攫鸟猛兽弗搏。骨弱筋柔而握固，未知牝牡之会而朘怒，精之至也。终日号而不嚘，和之至也。和曰常，知和曰明，益生曰祥，心使气曰强。物壮即老，是谓不道，不道早已。',
  },
  {
    title: '第五十六章',
    content:
      '知者弗言，言者弗知。塞其兑，闭其门，和其光，同其尘，挫其锐，解其纷，是谓玄同。故不可得而亲，亦不可得而疏；不可得而利，亦不可得而害；不可得而贵，亦不可得而贱。故为天下贵。',
  },
  {
    title: '第五十七章',
    content:
      '以正治邦，以奇用兵，以无事取天下。吾何以知其然也哉？夫天下多忌讳，而民弥贫；民多利器，而邦家滋昏；人多知，而奇物滋起；法物滋章，而盗贼多有。是以圣人之言曰：我无为而民自化，我好静而民自正，我无事而民自富，我欲不欲而民自朴。',
  },
  {
    title: '第五十八章',
    content:
      '其政闷闷，其民屯屯；其政察察，其民缺缺。祸福之所倚，福祸之所伏。孰知其极？其无正也。正复为奇，善复为妖。人之迷也，其日固久矣。是以方而不割，廉而不刺，直而不肆，光而不耀。',
  },
  {
    title: '第五十九章',
    content:
      '治人事天，莫若啬。夫唯啬，是以早服。早服谓之重积德。重积德则无不克，无不克则莫知其极。莫知其极，可以有国。有国之母，可以长久。是谓深根固柢，长生久视之道也。',
  },
  {
    title: '第六十章',
    content:
      '治大国若烹小鲜。以道莅天下，其鬼不神。非其鬼不神也，其神不伤人也。非其申不伤人也，圣人亦弗伤也。夫两不相伤，故德交归焉。',
  },
  {
    title: '第六十一章',
    content:
      '大邦者下流也，天下之牝也，天下之交也。牝恒以静胜牡，为其静也，故宜为下。大邦以下小邦，则取小邦；小邦以下大邦，则取于大邦。故或下以取，或下而取。故大邦者不过欲兼畜人，小邦者不过欲入事人。夫皆得其欲，则大者宜为下。',
  },
  {
    title: '第六十二章',
    content:
      '道者，万物之主也，是善人之宝也，不善人之所保也。美言可以市尊，行可以加人。人之不善，何弃之有？故立天子，置三公，虽有拱璧以先驷马，不如坐而进此。古之所以贵此者何也？不谓求以得，有罪以免与？故为天下贵。',
  },
  {
    title: '第六十三章',
    content:
      '为无为，事无事，味无味。大小多少，报怨以德。图难乎其易也，为大乎其细也。天下之难作于易，天下之大作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终于无难。',
  },
  {
    title: '第六十四章',
    content:
      '其安也，易持也；其未兆也，易谋也；其脆也，易破也；其微也，易散也。为之于其未有也，治之于其未乱也。合抱之木，生于毫末；九成之台，作于羸土；百仞之高，始于足下。为之者败之，执者失之。是以圣人无为也，故无败也；无执也，故无失也。民之从事也，恒于其成事而败之。故慎终若始，则无败事矣。是以圣人欲不欲，而不贵难得之货；学不学，而复众人之所过。能辅万物之自然而弗敢为。',
  },
  {
    title: '第六十五章',
    content:
      '故曰：为道者非以明民也，将以愚之也。民之难治也，以其知也。故以知知邦，邦之贼也；以不知知邦，邦之德也。恒知此两者，亦稽式也。恒知稽式，此谓玄德。玄德深矣，远矣，与物反矣，乃至大顺。',
  },
  {
    title: '第六十六章',
    content:
      '江海之所以能为百谷王者，以其善下之，是以能为百谷王。是以圣人之欲上民也，必以其言下之；其欲先民也，必以其身后之。故居前而民弗害也，居上而民弗重也。天下乐推而弗厌也，非以其无争与？故天下莫能与争。',
  },
  {
    title: '第六十七章',
    content:
      '小邦寡民，使十百人之器毋用，使民重死而远徙。有车周无所乘之，有甲兵无所陈之。使民复结绳而用之。甘其食，美其服，乐其俗，安其居。邻邦相望，鸡狗之声相闻，民至老死不相往来。',
  },
  {
    title: '第六十八章',
    content:
      '信言不美，美言不信。知者不博，博者不知。善者不多，多者不善。圣人无积，既以为人己愈有，既以予人己愈多。故天之道，利而不害；人之道，为而弗争。',
  },
  {
    title: '第六十九章',
    content:
      '天下皆谓我大，不肖。夫唯大，故不肖。若肖，细久矣。我恒有三宝，持而宝之：一曰慈，二曰俭，三曰不敢为天下先。夫慈，故能勇；俭，故能广；不敢为天下先，故能为成事长。今舍其慈且勇，舍其俭且广，舍其后且先，则必死矣。夫慈，以战则胜，以守则固。天将建之，如以慈垣之。',
  },
  {
    title: '第七十章',
    content:
      '善为士者不武，善战者不怒，善胜敌者弗与，善用人者为之下。是谓不争之德，是谓用人，是谓天，古之极也。',
  },
  {
    title: '第七十一章',
    content:
      '用兵有言曰：吾不敢为主而为客，吾不进寸而芮尺。是谓行无行，攘无臂，执无兵，乃无敌矣。祸莫大于无敌，无敌近亡吾葆矣。故称兵相若，则哀者胜矣。',
  },
  {
    title: '第七十二章',
    content:
      '吾言甚易知也，甚易行也，而人莫之能知也，而莫之能行也。言有君，事有宗。其唯无知也，是以不我知。知我者希，则我贵矣。是以圣人被褐而怀玉。',
  },
  {
    title: '第七十三章',
    content: '知不知，尚矣；不知不知，病矣。是以圣人之不病，以其病病也，是以不病。',
  },
  {
    title: '第七十四章',
    content:
      '民之不畏威，则大威将至矣。毋狎其所居，毋厌其所生。夫唯弗厌，是以不厌。是以圣人自知而不自见也，自爱而不自贵也。故去彼而取此。',
  },
  {
    title: '第七十五章',
    content:
      '勇于敢者则杀，勇于不敢者则栝。此两者，或利或害。天之所恶，孰知其故？天之道，不战而善胜，不言而善应，不召而自来，坦而善谋。天网恢恢，疏而不失。',
  },
  {
    title: '第七十六章',
    content:
      '若民恒且不畏死，奈何以杀惧之也？若民恒是死，则而为者，吾将得而杀之，夫孰敢矣？若民恒且必畏死，则恒有司杀者。夫代司杀者杀，是代大匠斫也。夫代大匠斫者，则希不伤其手矣。',
  },
  {
    title: '第七十七章',
    content:
      '人之饥也，以其取食税之多也，是以饥。百姓之不治也，以其上之有以为也，是以不治。民之轻死，以其上求生之厚也，是以轻死。夫唯无以生为者，是贤贵生。',
  },
  {
    title: '第七十八章',
    content:
      '人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故曰：坚强者死之徒也，柔弱微细生之徒也。兵强则不胜，木强则恒。强大居下，柔弱微细居上。',
  },
  {
    title: '第七十九章',
    content:
      '天下之道，犹张弓者也。高者抑之，下者举之；有余者损之，不足者补之。故天之道，损有余而益不足。人之道则不然，损不足以奉有余。孰能有余而有以取奉于天者乎？唯有道者乎？是以圣人为而弗有，成功而弗居也。若此，其不欲见贤也。',
  },
  {
    title: '第八十章',
    content:
      '天下莫柔弱于水，而攻坚强者莫之能胜也，以其无以易之也。水之胜刚也，弱之胜强也，天下莫弗知也，而莫之能行也。故圣人之言云曰：受邦之垢，是谓社稷之主；受邦之不祥，是谓天下之王。正言若反。',
  },
  {
    title: '第八十一章',
    content:
      '和大怨，必有余怨，焉可以为善？是以圣右介而不以责于人。故有德司介，无德司彻。夫天道无亲，恒与善人。',
  },
]
